# ExtrusionRoof Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExtrusionRoof Class
Members See Also
---
Represents some kinds of Extrusion Roofs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ExtrusionRoof : RoofBase
```

Visual Basic
---
```text
Public Class ExtrusionRoof _
	Inherits RoofBase
```

Visual C++
---
```text
public ref class ExtrusionRoof : public RoofBase
```

# Remarks
The ExtrusionRoof object represents some kinds of extruded roofs in Revit.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..HostObject Autodesk.Revit.DB..::..RoofBase Autodesk.Revit.DB..::..ExtrusionRoof
# See Also
ExtrusionRoof Members
Autodesk.Revit.DB Namespace